package cn.itcast.day09.demo10;

// 抽象类:抽象方法所在的类，必须是抽象类才行，在 class 之前写上 abstract
public abstract class Animal {
    // 抽象方法:加上 abstract 关键字，然后去掉大括号，直接分号结束
    public abstract void eat();

    // 普通的成员方法
    public void normalMethod() {

    }

}

/*
* 如何使用抽象类和抽象方法：
* 1.不能直接创建new抽象类对象
* 2.必须用一个子类来继承抽象父类
* 3.子类必须覆盖重写（实现）父类当中所有的抽象方法（否则报错）
*   去掉抽象方法中的 abstract 关键字，补上方法体大括号
* 4.创建子类对象，进行使用
*
* 注意事项：
* 1.抽象类不能直接创建对象，否则报错
* 2.可以有构造方法，供子类创建对象时，初始化父类成员
* 3.抽象类中不一定包含抽象方法，但是有抽象方法的类必定是抽象类
* 4.抽象类的子类，必须重写抽象父类中的所有抽象方法，否则报错
*   */
